app/controllers/api/activities_controller.rb

    def index
        # if current_user #for profile
        #     @posts = current_user.posts
        # else #for dashboard
        #     @user = User.find_by(id: params[:id])

        #     @followings = @user.follows

        #     @posts = []
        #     @followings.each do |follow|
        #         @follwed_user = follow.

        #     @posts = @user.posts
        # end

        @activities = Activity.all
---
SELECT "activities".* FROM "activities"

    def show
        @activity = Activity.find_by(id: params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @activity = Activity.new(activity_params)

        if @activity.save
---
INSERT INTO "activities" ("title", "body", "author_id", "created_at", "updated_at", "distance", "pace", "hours", "minutes", "seconds", "posted_on") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        @activity = Activity.find_by(id: params[:id])

        if @activity.update(activity_params)
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "activities" SET "title" = $1, "distance" = $2, "pace" = $3, "hours" = $4, "minutes" = $5, "seconds" = $6, "updated_at" = $7 WHERE "activities"."id" = $8  [["title", "EDITED"], ["distance", 9], ["pace", 9], ["hours", 9], ["minutes", 10], ["seconds", 30], ["updated_at", "2022-06-28 18:34:36.658506"], ["id", 12]]

    def destroy
        @activity = Activity.find_by(id: params[:id])
        if @activity
            @activity.destroy!
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 4]]