app/controllers/api/follows_controller.rb

    def index
        if current_user #for profile
            @follows = current_user.followers
            @users = []
            @follows.each do |follow|
---
SELECT "follows".* FROM "follows"