app/controllers/api/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def index
        if current_user #for profile
            @posts = current_user.posts
        else #for dashboard
            @user = User.find_by(id: params[:id])

INSERT INTO "posts" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "melting"], ["author_id", 2], ["created_at", "2022-06-21 19:52:17.045533"], ["updated_at", "2022-06-21 19:52:17.045533"]]
---
    def create
        @post = Post.new(post_params)

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Do NOT NOT need carbs"], ["updated_at", "2022-06-21 19:57:27.356844"], ["id", 1]]
---
    def update
        @post = Post.find_by(id: params[:id])

        if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
    def destroy
        @post = Post.find_by(id: params[:id])
        if @post
            @post.destroy!