app/controllers/api/posts_controller.rb

    def index #get all posts when you go to a users profile, filtered by time created//have to be an array
        # @user = User.find_by(id: params[:id])

        # @posts = @user.posts

        @posts = Post.all
---
SELECT "posts".* FROM "posts"