app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "yfiGgmcHDJD8_VwUcTxX9g"], ["updated_at", "2022-06-21 23:58:24.665631"], ["id", 4]]